Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ལ་སོགས་པ་འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པར་རིག་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་རྒྱན་གྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ།
en: At this point, the gods of Nirmāṇarati, such as Sunirmāṇarati, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine ornaments on him in worship.

source: ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་དོ། །
en: They joined their palms and praised him with the following words:

source: ཆོས་ཀྱི་ཟོང་གིས་རང་གི་སྟོབས་བཅུ་མཁའ་འདྲ་འོད་ཟེར་ལྡན་པ་དང་། །
en: “Through the boon of the Dharma, you possess ten space-like strengths and luminosity.

source: ཐུགས་རྗེ་བརྙེས་ནས་བྱམས་པའི་དགོངས་པས་སེམས་ཅན་རྣམས་ལ་གཟུགས་སྟོན་པ། །
en: Because you possess compassion, you appear tangibly before sentient beings with loving regard.

source: གྲུ་ཚུལ་ཆོས་ལ་གཉིས་སུ་མེད་པར་ཞུགས་ཀྱང་རྒྱལ་བ་མཚུངས་པར་མཁྱེན། །
en: Although you have entered the nonduality of phenomena in the manner of a ship,

source: ཆོས་ཀྱི་ཁྱད་པར་སེམས་ལྷག་དོན་ཀུན་གྲུབ་པའི་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: We pay homage to the Victor who has accomplished all aims with a special intention enhanced by Dharma.”

source: དེ་ནས་འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་བར་གྱུར་ཏོ། །
en: After the gods of Nirmāṇarati had praised the Blessed One with this verse, they joined the procession to attend to him.

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་དབང་སྒྱུར་ལ་སོགས་པ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐེམ་སྐས་སུ་ཞུགས་པ་དང་། འཁོར་གྱི་ཁྱམས་སུ་མངོན་པར་ཕྱོགས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མུ་ཏིག་གི་དོ་ཤལ་གྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་སྟེ
en: At this point, the gods of Para­nirmitavaśavartin, such as Vaśavartin, the king of the gods, noticed that the Blessed One had ascended the staircase and was now facing the pavilion, and they showered clouds of divine pearl garlands on him in worship.

source: ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: They joined their palms and praised him with the following words:

source: ཚུལ་ཁྲིམས་དྲི་མ་མི་མངའ་རྣམ་དག་རྣམ་པར་ངེས་པ་དམ་པ་ཏིང་ངེ་འཛིན་མཆོག་མི་གཡོས་པ། །མཉམ་མེད་བློ་ལྡན་རྒྱ་མཚོ་འདྲ་བར་གནས་ཤིང་སྲིད་ལས་རྣམ་གྲོལ་དབང་སྒྱུར་ཞབས་ལ་ཕྱག་འཚལ་ལོ། །
en: “We pay homage at the feet of the master, whose moral conduct is stainless, pure, perfected, and excellent, and whose absorption is stable, The incomparably intelligent one who is like the ocean, who is liberated from existence.

source: རིམ་གྱིས་བྱམས་དང་ལྡན་པའི་ཐུགས་རྗེ་ཡིས་ནི་བདེན་པའི་ལམ་གྱི་རྣམ་པ་རབ་ཏུ་གནས་མཛད་པ། །རྣམ་ཐར་གསུམ་གྱི་ལམ་གྱི་ཁྱམས་ན་གནས་པའི་བདེ་གཤེགས་སེང་གེ་ཁྱོད་ལ་བདག་ཅག་ཕྱག་འཚལ་ལོ། །
en: We pay homage to you, the Lion Sugata who progressively delineates the various aspects of the true path out of compassion filled with loving kindness, And who dwells in the way stations of the three liberations.

source: སྙིང་རྗེའི་ཆུ་བོ་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་འཕེལ་བ། །
en: Who broadens the river of compassion through absorption,

source: ཞི་གནས་འདབ་མ་རྣམ་པར་གྲོལ་བའི་མེ་ཏོག་རྒྱས། །
en: Who opens the petals of tranquil abiding on the flowers of liberation,

source: སློབ་མའི་ཚོགས་ཀྱི་བུང་བས་ངེས་པར་བསྙེན་གྱུར་པ། །
en: And who is attended by an assembly of disciples like swarming bees.

source: བདེ་གཤེགས་པད་མ་ལ་ནི་སྤྱི་བོས་ཕྱག་འཚལ་ལོ། །
en: “We pay homage respectfully to you, Lotus Sugata

source: མངའ་བདག་གཡོ་བ་མ་མཆིས་ཚུལ་ཁྲིམས་སར་གནས་པས། །
en: Who is established on the ground of firm moral conduct,

source: བརྩོན་འགྲུས་མཚུངས་པ་མ་མཆིས་སྟོབས་ཀྱིས་ཡང་དག་འཕགས། །
en: Who has risen up through the power of unrivaled energy,

source: ཡུལ་གྱི་རླུང་རྣམས་ལངས་པ་ཆེན་པོས་མི་གཡོས་པ། །
en: And who is not shaken by the great tempest of the winds of objects.

source: སངས་རྒྱས་རི་བོ་དམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “We pay homage to you, Sacred Mountain Buddha

source: མངའ་བདག་ཐུགས་རྗེས་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་དག་པ། །
en: Who is a pure maṇḍala of melodies,

source: བློ་གཏེར་བློ་མཆོག་གིས་ནི་རབ་ཏུ་འཇོམས་མཛད་པ། །
en: Whose mind treasury of supreme intelligence is overwhelming,

source: སེམས་ཅན་བརྒྱ་དག་གིས་ནི་མང་པོས་མཆོད་གྱུར་པ། །
en: And to whom hundreds of sentient beings attend with many offerings.

source: བདེ་གཤེགས་ཟླ་བ་ཁྱོད་ལ་བདག་ཅག་ཕྱག་འཚལ་ལོ། །
en: “We pay homage to you, Moon Sugata

source: མཁའ་ལྟར་ཞི་བའི་རྣམ་པར་ཐར་པའི་ལམ་གཤེགས་པ། །
en: Who proceeds on the path of full emancipation of peace, which is like the sky,

source: ཤེས་རབ་འོད་ཀྱིས་ཕྱོགས་བཅུ་དག་ནི་རྒྱས་འགེངས་ཤིང་། །
en: Who suffuses the expanse of the ten directions with the rays of insight,

source: སྐྱེ་བོ་མང་པོ་མཚུངས་མེད་པད་མ་ཁ་འབྱེད་པ། །
en: And who opens the incomparable lotus flowers of many beings.

source: སངས་རྒྱས་ཉི་མ་དམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “We pay homage to you, Noble Sun Buddha

source: མངའ་བདག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གསུམ་པོ་དག་ན་ཡང་། །
en: “Master, in the three worlds and ten directions

source: འདྲེན་པ་ཁྱོད་དང་མཉམ་པ་དམིགས་པར་མ་གྱུར་ཏེ། །
en: We find no guide equal to you.

source: ཁྱོད་ནི་ཡོན་ཏན་ཀུན་གྱིས་ཡང་དག་གྲུབ་པ་ལགས། །
en: You who have accomplished all the buddha qualities—

source: བདག་ཅག་ཁྱོད་ལ་བསྟོད་པས་ངོམས་པར་འགྱུར་མ་ལགས། །
en: We can never get enough of praising you.

source: ལྷ་དབང་ཀླུ་དང་ལྷ་མ་ཡིན་གྱིས་ཕྱག་བགྱིས་པ། །
en: The celestial rulers, nāgas, and asuras pay tribute to you,

source: ལྷ་མཆོག་བརྒྱ་དག་གིས་ཀྱང་ཡང་དག་མངོན་བསྟོད་པ། །
en: And many hundreds of supreme gods truly extoll you.

source: བསྔགས་པ་བརྒྱ་ཕྲག་མང་པོས་ཡང་དག་མངོན་བསྟོད་པ། །
en: You are truly extolled by many hundreds of eulogies.”

source: བདེ་བར་གཤེགས་པ་བསྟོད་འོས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “We pay homage to you, Honorable Sugata.

source: དེ་ནས་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་ངོ་། །
en: After the gods of Para­nirmitavaśavartin had praised the Blessed One with these verses, they joined the procession to attend to him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཡུལ་རྣམ་པར་སྤྲུལ་པ་ཚད་མེད་པ་ལྷ་འབུམ་གྱིས་མངོན་པར་བསྟོད་ནས་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་གཤེགས་ཏེ།
en: After the many gods had thus praised the vast display of the buddha domain, the Buddha entered the pavilion called Jeweled Array.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཐེམ་སྐས་ནས་འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་གཤེགས་པ་ཤེས་པ་དེ་བཞིན་དུ། སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་ཡང་གཤེགས་པར་ཤེས་སོ། །
en: Just as they realized that the Blessed One had gone to the pavilion Jeweled Array via the staircase in this world system of Endurance, they realized that he had also done so in all the world systems of the trichiliocosm.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཁྱམས་སྟོང་གསུམ་གྱིས་ཡོངས་སུ་གཟུང་བ་རིན་པོ་ཆེ་བཀོད་པར་གདན་སེང་གེའི་ཁྲི་ཇི་ལྟར་བཤམས་པ་ལ་བཞུགས་སོ། །
en: At this point, the Blessed One sat down on the lion throne that had been prepared in the pavilion Jeweled Array, encompassed by the trichiliocosm.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཆེན་པོ་དག་ཀྱང་སྟན་ཅི་རིགས་པ་ལ་འཁོད་པར་གྱུར་ཏོ། །
en: The bodhisattvas and the great śrāvakas also took their seats.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམ་པར་ཐར་པ་སྒྲིབ་པ་མེད་པ་ལ་སངས་རྒྱས་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: At this time, the Blessed One attained a buddha absorption called buddha play in unveiled liberation.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་རྣམ་པར་ཐར་པ་སྒྲིབ་པ་མེད་པ་ལ་སངས་རྒྱས་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ཀྱི་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱུང་སྟེབྱུང་ནས་ཀྱང་
en: No sooner had he attained that absorption than as many light rays as there are grains of sand in the river Ganges shone forth from each and every pore of his body.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱས་སོ། །དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་གི་ཕྱོགས་རྣམས་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་མཚམས་རྣམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱས་སོ། །
en: They illuminated all the world systems in the eastern, southern, western, and northern directions. They illuminated the zenith and the nadir, and the intermediate directions as well.

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སྣང་བར་བྱས་མ་ཐག་ཏུ། དེ་ནས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྒྱུན་ཆད་དོ། །
en: As soon as all the world systems had been illuminated in this way, the suffering experienced by sentient beings tormented in the hell realms ceased.

source: དུད་འགྲོའི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་དང་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཡང་རྒྱུན་ཆད་དོ། །
en: The suffering experienced by beings in the world of Yama and the suffering experienced by beings in the animal realm also ceased.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་དེ་ལ་འདོད་ཆགས་ཀྱིས་གནོད་པར་མ་གྱུར་ཅིང་། ཞེ་སྡང་གིས་མ་ཡིན། གཏི་མུག་གིས་མ་ཡིན་ཏེ། ཉོན་མོངས་པ་གཞན་གྱིས་ཀྱང་གནོད་པར་མ་གྱུར་ཏོ། །དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱམས་པའི་སེམས་དང་། ཕ་མ་ལྟ་བུའི་འདུ་ཤེས་སུ་གྱུར་ཏོ། །
en: In that instant, attachment, aversion, delusion, and all the other afflictive emotions ceased to afflict sentient beings, who all became kind and loving, and considered beings to be like their parents.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པའི་འོད་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་། །
en: In order to invite the bodhisattvas through the Buddha’s might, the following verses emanated from the light rays streaming from the Tathāgata:

source: གང་གིས་བརྩོན་འགྲུས་སྟོབས་ནི་མཐའ་ཡས་ཡངས་པ་བརྟན་པ་བརྩམས་གྱུར་ཏེ། །
en: “The Buddha sets out thanks to a vast, expansive, and enduring energy.

source: གང་གིས་བརྩོན་འགྲུས་ཆེན་པོའི་སྟོབས་ཀྱིས་བསྐལ་པ་དག་ལས་ཕྱིར་ཕྱོགས་སྤངས། །
en: Through this great energy, he has refrained from turning back throughout the ages.

source: གང་གིས་ཡོན་ཏན་དག་ནི་ཕྱོགས་བཅུ་རྣམས་ན་མཐུ་ལྡན་རབ་བརྗོད་པ། །
en: His qualities are conveyed forcefully in the ten directions.

source: ཤཱཀྱ་ཐུབ་པའི་འོད་ཡངས་འགྲོ་བ་ཐམས་ཅད་སྣང་བར་བྱེད་པ་མཛེས། །
en: The radiance of Śākyamuni is beautiful in illuminating all destinies.

source: གང་ཆོས་རྒྱ་ཆེན་བླ་མེད་མཉན་སླད་དེ་ཡི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། །
en: “Some pay homage at his feet in order to listen to the vast, unsurpassed teachings.

source: མཁས་པ་བློ་གྲོས་བརྟན་པ་དག་ནི་བསྐལ་པ་གྲངས་མེད་རྟག་ཏུ་ཉན། །
en: Those firm in learning and intelligence listen continuously for countless eons.

source: བློ་རྒྱས་གང་ཞིག་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཚིམ་སྐྱེད་པ། །
en: Those with open minds generate contentment through their aspiration for perfect awakening.

source: ཐུབ་པ་དེས་ནི་གང་ཕྱིར་སེམས་ཅན་བདེ་བར་བཞེད་པས་འོད་འདི་ཕྱུང་། །
en: The Capable One radiates light with his wish for sentient beings to be happy.

source: མངའ་བདག་གང་ཞིག་བརྩོན་འགྲུས་ཀྱིས་ནི་བདུད་སྟོབས་མུ་སྟེགས་ཚོགས་བཅས་ཕམ་མཛད་ནས། །
en: “Since the master has energetically conquered hosts of powerful demons and non-Buddhists,

source: པདྨ་བྱུང་བ་བཞིན་དུ་འཕགས་ཤིང་ཕྱོགས་བཅུ་དག་ཏུ་ལྷུན་པོ་ཇི་བཞིན་མཛེས། །
en: He is eminent like a lotus in bloom, beautiful like the Merus in the ten directions.

source: གང་ཞིག་ཉི་མ་བཞིན་དུ་སྐུ་ཡི་འོད་ཀྱིས་འགྲོ་བ་མ་ལུས་སྣང་མཛད་པ། །
en: Like the sun, he illuminates all destinies with the radiance of his physical form.

source: དེ་ཡི་ཆོས་ཀྱི་འཁོར་ལོ་གཞག་པ་དོན་ཆེན་གསན་དུ་རྒྱལ་བ་གཤེགས་སུ་གསོལ། །
en: We pray that the Victor comes so that the great meaning in his Dharma wheel may be heard.

source: རབ་ཏུ་བསྐོར་བར་མ་གྱུར་མཚུངས་པ་མེད་ཅིང་རྒྱལ་བ་ཀུན་གྱིས་བསྐོར་གྱུར་པ། །འཁོར་ལོ་དམ་པ་སྟོབས་བཅུ་སེམས་ཅན་ཐུགས་བརྩེ་ཕྱིར་ནི་དེ་རིང་སྐོར་བར་མཛད། །
en: “Out of heartfelt love for beings, he will today, with his ten strengths, turn the sacred wheel, Which he has not yet turned, which is unrivaled, and which is turned by all the victors.

source: སྲོག་ཆགས་རྣམས་ཀྱིས་བསྟེན་པར་རྙེད་དཀའ་ལེགས་པ་རྒྱ་ཆེན་དེ་རིང་འབྱུང་བར་འགྱུར། །
en: Upheld by living beings, today this vast good fortune, so rare for beings to encounter, will arise.

source: གང་དག་དད་པ་དང་བ་ཆེ་ཡངས་དོན་དུ་གཉེར་བ་དེ་དག་དེ་རིང་ལྟོས། །
en: Today may those with pure and vast faith behold what they seek.”

source: དེ་ནས་འོད་ཟེར་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་གོ་བར་བྱས།
en: The light rays transmitted these words to all buddhafields.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡང་དག་པར་བསྐུལ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རབ་ཏུ་གཡོ་བར་བྱས། སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱས། ཉོན་མོངས་པའི་ཁམས་ཐམས་ཅད་རྣམ་པར་སྦྱངས།
en: They invited all bodhisattvas, made all world systems tremble, made all sentient beings happy, and purified all elements of the afflictive emotions.

source: མུན་པ་མུན་ནག་ཐམས་ཅད་བསལ། བདུད་ཀྱི་ཁྱིམ་ཐམས་ཅད་མོག་མོག་པོར་བྱས་ནས་
en: The light rays illuminated Tamondha­kāra and obscured the dwelling places of Māra.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དཔག་ཏུ་མེད་པ་དག་དང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་སླར་འོངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: They then returned to the immense circle of bodhisattvas and the world system of Endurance, where they disappeared into the top of the Blessed One’s head.

source: དེ་ནས་ཤར་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་རྣམ་དག་རིན་ཆེན་འོད་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་ལྡན་པའི་ཆོས་རྒྱུན་མི་འཆད་པའི་འོད་ཟེར་བཀོད་པའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་མཐའ་ཡས་པའི་རིན་པོ་ཆེའི་བསོད་ནམས་བཀོད་པས་རྒྱ་ཆེ་བ་དང་ལྡན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་དཔལ་གྱི་སྙིང་པོ་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་ཞེས་བྱ་བ་
en: The light rays first invited the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin to come. He resided in a buddhafield situated in the east, called Endowed with the Vast Display of the Precious Merits of Endless Qualities, of the Tathāgata Immaculate Pure Precious Light, Sovereign of the Uninterrupted Luminous Display of Dharma Endowed with the Factors of Awakening.

source: འོད་དེས་བསྐུལ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེལྷན་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེ།
en: As soon as the light rays reached this bodhisattva, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor. They all left that buddhafield together and arrived in an instant in this world system of Endurance.

source: འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.

source: ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལྷའི་ནོར་བུ་བཻ་དཱུརྱའི་དྲ་བའི་ཆར་རབ་ཏུ་ཕབ་སྟེ།
en: They circumambulated him ten thousand times and in worship showered a multitude of divine gems and beryl upon him.

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Then they praised him with these words:

source: བཅོམ་ལྡན་རབ་ཏུ་མཚུངས་མེད་ཡོན་ཏན་ཕ་རོལ་ཕྱིན། །
en: “Blessed One, incomparable and endowed with perfected qualities—

source: ཁྱོད་ཀྱི་ཡོན་ཏན་བསྔགས་ཕྲེང་ཕྱོགས་བཅུ་ཀུན་ན་བརྗོད། །
en: Garlands of praise in honor of your qualities reverberate in all ten directions!

source: ཁྱོད་ཀྱི་ཡོན་ཏན་ཚོགས་མཆིས་ཞིང་གང་ཡོན་ཏན་གཏེར། །
en: Your qualities are many—a treasury of good qualities.

source: དེར་ནི་ཆོས་དོན་གཉེར་བ་བདག་ཅག་རབ་ཏུ་མཆི། །
en: We come here in pursuit of the Dharma.

source: ཆོས་དབྱིངས་མཉམ་ཉིད་རྣམ་རྟོག་མ་མཆིས་ཇི་བཞིན་དུ། །
en: “Just as there is no conceptuality in the sameness of the realm of phenomena,

source: བཅོམ་ལྡན་དྲི་མེད་འོད་ཀྱིས་མཉམ་པ་ཉིད་མཁྱེན་ཀྱང་། །
en: So the Blessed One knows sameness through his stainless light.

source: ཤིན་ཏུ་བསླབ་པའི་སྒྱུ་མ་མཁན་ལྟར་ཆོས་ཀྱི་རྒྱལ། །
en: Like a well-trained magician, the Dharma king

source: སེམས་ཅན་རྣམ་པར་དགྲོལ་སླད་ཐ་དད་བསྟན་པ་མཛད། །
en: Presents various Dharmas in order to liberate sentient beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས། ཤར་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once those bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the eastern corner of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་ལྷོ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྤོབས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་སྤོབས་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་སྲོག་ཤིང་ཞེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Ratnayaṣṭi to come. He resided in a buddhafield situated in the south, called Buddha Courage, of the Tathāgata Countless Qualities Precious Courage.

source: འོད་དེས་བསྐུལ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: ལྷན་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏེ།
en: They all left that buddhafield together and arrived in an instant in this world system of Endurance.

source: ལན་ཁྲི་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་གསེར་གྱི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of gold.

source: ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །
en: Then they praised him with these words:

source: བཅོམ་ལྡན་ཐུགས་རྗེའི་སྤྲིན་གྱིས་འཇིག་རྟེན་རྒྱས་བཀང་ནས། །
en: “Blessed One, you fill the whole world with clouds of compassion,

source: འོད་ཀྱི་གློག་ཕྱུང་སྟོང་པ་བདག་མེད་སྒྲ་བསྒྲགས་ཏེ། །
en: You wield the lightning bolts and roar the sounds of ‘empty’ and ‘no self,’

source: ཡན་ལག་བརྒྱད་པའི་ལམ་གྱི་ཆུ་ཡིས་ཞི་མཛད་ཅིང་། །
en: You pacify it with the waters of the eightfold path,

source: དཀར་པོའི་སྟོབས་དབང་ནགས་ཚལ་གེལ་པ་འཕེལ་བར་མཛད། །
en: And you bring to maturity a forest grove of virtuous strengths.

source: བདེ་གཤེགས་ཤེས་རབ་འོད་ཀྱིས་གཏི་མུག་མུན་བསལ་ནས། །
en: “You dispel the darkness of ignorance with the light of the sugata wisdom,

source: རིང་ནས་སྲིད་མཚོར་གཉིད་ལོག་སེམས་ཅན་སད་མཛད་དེ། །
en: You awaken sentient beings from their long slumber in the ocean of existence,

source: ལམ་ཡང་བསྟན་ཅིང་སྲེད་པ་དག་ཀྱང་སྐམས་པར་མཛད། །
en: You show the path and cause craving to dry up,

source: ཐར་པའི་གྲོང་གནས་རྣམས་ཀྱི་མིག་ཀྱང་རྣམ་པར་སྦྱོང་།
en: And you purify the vision of those dwelling in the city of liberation.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southern corner of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་ནུབ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་བསྒྲགས་པའི་སྟོབས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ
en: Then the light rays invited the bodhisattva Sovereign of Powerful Reverberating Sound to come. He resided in a buddhafield situated in the west, called Illuminated, of the Tathāgata Illuminator. As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་ནོར་བུ་མུ་ཏིག་གི་དོ་ཤལ་གྱི་ཕྲེང་བའི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of pearl necklaces.

source: ཁྱོད་ཀྱི་སྐུ་ཡི་འཕྲིན་ལས་ནམ་མཁའི་ཁམས་འདྲ་ཞིང་། །
en: “Your physical actions resemble the domain of space.

source: སྨོན་ལམ་དགེ་བས་དག་པ་བྱེ་བ་ཕྲག་མང་ལྡན། །
en: Your virtuous prayer is endowed with boundless purity.

source: དྲི་མེད་རྣམ་པར་དག་ཅིང་ཟག་པ་མེད་པ་དེས། །
en: Since it is stainless, pure, and without defilements,

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཞིང་རྣམས་བསམ་གྱིས་མི་ཁྱབ་གསལ། །
en: It purifies the inconceivable buddhafields of the ten directions.

source: ཁྱོད་ཀྱི་ཚིག་ནི་རྒྱུན་ཆགས་གསལ་ཞིང་མཚུངས་པ་སྟེ། །
en: “Your speech is steady, illuminating, and coherent.

source: འགྲོ་བ་བསམ་དག་བསམ་པ་མཉམ་ཉིད་ཡོངས་ཚིམ་བགྱིད། །
en: It appeases the dispositions of beings with uniformity of thought.

source: སེམས་ཀྱི་རྒྱུ་དང་རྣམ་རྟོག་གང་ཡང་མི་མངའ་ཡང་། །
en: Even though there is not the slightest mental movement or conception,

source: སེམས་ཅན་བསམ་པ་རྣམས་ལ་རྒྱལ་བ་དག་གི་འབྱུང་། །
en: Victors arise in the minds of sentient beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the western corner of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་བྱང་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྤོབས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་མཆོག་རྒྱ་མཚོ་ཞེས་བྱ་བ་
en: Then the light rays invited the bodhisattva Ocean of Supreme Intelligence to come. He resided in a buddhafield situated in the north, called Fully Adorned with Jewels, of the Tathāgata Countless Qualities Precious Courage.

source: འོད་དེས་བསྐུལ་མ་ཐག་ཏུ། བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ
en: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.

source: བཅོམ་ལྡན་འདས་ལ་ལན་ཁྲི་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་ཅིང་ནོར་བུའི་དོ་ཤལ་དང་རིན་པོ་ཆེའི་དྲ་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of crystals and jewels.

source: འཛམ་བུའི་ཆུ་གསེར་བཙོ་མ་ལྟ་བུར་སེར་བའི་སྐུ། །
en: “Your golden body is like refined gold from the Jambu River.

source: ཀུན་ནས་སྤྱན་མངའ་ཕྱོགས་བཅུ་དག་ཏུ་རྣམ་པར་མཛེས། །
en: Possessing the all-seeing eye, it shines throughout the ten directions.

source: མཚུངས་མེད་སྐུ་ལ་སེམས་ཅན་གང་དག་ངེས་རྟོག་པ། །
en: The beings who think of this unique form

source: དེ་དག་སྐྱོན་མེད་བདེ་ཞིང་དགའ་བ་ཐོབ་པར་འགྱུར། །
en: Will achieve flawless bliss and joy.

source: གང་གིས་ལྷུན་པོ་བརྩེགས་པ་ལྟ་བུའི་ཁྲུན་ཙམ་དུ། །འཇིག་རྟེན་མཁྱེན་པ་མཚུངས་མེད་རྒྱལ་བ་བལྟས་ཀྱང་ནི། །
en: “Even when one gazes upon the Victor, The unique knower of the world, as tall as Mount Meru,

source: དེ་ཡི་རྫུ་འཕྲུལ་ཀུན་གྱི་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི། །རྣམ་པར་སྤྲུལ་པས་རྒྱལ་བའི་སྤྱི་གཙུག་མཐོང་མི་ནུས། །
en: Because of the force of all his miraculous powers and the display of his energy One is unable to see this Victor’s crown protuberance.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་ཚད་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་བྱང་ཕྱོགས་ལོགས་སུ་གནས་ཏེ། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སྤྲུལ་པའི་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ། །
en: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northern corner of the pavilion and sat down upon seats created by their own miraculous power.

source: དེ་ནས་ཤར་དང་ལྷོའི་མཚམས་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་བཅོམ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་སྣང་བ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་མ་ཐག་ཏུ།
en: Then the light rays invited the bodhisattva Illuminator to come. He resided in a buddhafield situated in the southeast, called Sorrowless, of the Tathāgata Conqueror of All Sorrow.
